In [1]:
import pandas as pd
import numpy as np

In [3]:
#membuat dataFrame dengan datanya random terdiri dari 5 baris dan 4 kolom
#dengan indexnya adalah A B C D E yang di split
#Split adalah memotong-motong string dan menjadikannya sebuah array
#menetapkan kolomnya adalah W X Y Z yang di split
df = pd.DataFrame(np.random.randn(5,4), index='A B C D E'.split(),columns='W X Y Z'.split())
df

          W         X         Y         Z
A  0.968072  0.401730  1.024553 -1.134056
B  1.778940  0.404267  0.527373 -1.474771
C  1.070322 -0.993801  1.546466 -1.207064
D  1.365902 -0.266971 -0.610776  2.529176
E -0.494298 -0.485794 -0.074890 -0.214137

In [4]:
#Untuk menampilkan data satuan pada dataFrame
df['W'] #menampikan data pada kolom w

A    0.968072
B    1.778940
C    1.070322
D    1.365902
E   -0.494298
Name: W, dtype: float64

In [6]:
#bisa juga seperti ini tapi cara ini tdk di recomendasikan
df.W

A    0.968072
B    1.778940
C    1.070322
D    1.365902
E   -0.494298
Name: W, dtype: float64

In [7]:
# Menampilkan 2 kolom sekaligus & harus memakai kurung [] 2x
df[['W','Z']]

          W         Z
A  0.968072 -1.134056
B  1.778940 -1.474771
C  1.070322 -1.207064
D  1.365902  2.529176
E -0.494298 -0.214137

In [8]:
# Membuat kolom baru yang bernama baru yang datanya di ambil dari kolom W di tambah kolom Y
df['baru'] = df['W'] + df['Y']
df

          W         X         Y         Z      baru
A  0.968072  0.401730  1.024553 -1.134056  1.992625
B  1.778940  0.404267  0.527373 -1.474771  2.306312
C  1.070322 -0.993801  1.546466 -1.207064  2.616788
D  1.365902 -0.266971 -0.610776  2.529176  0.755126
E -0.494298 -0.485794 -0.074890 -0.214137 -0.569188

In [9]:
#menghapus kolom
df.drop('baru',axis=1) #baru adalah nama kolom dan axis adalah posisi atau tempat yang akan di hapus
                       #jika 0 = index dan jika 1 = kolom

          W         X         Y         Z
A  0.968072  0.401730  1.024553 -1.134056
B  1.778940  0.404267  0.527373 -1.474771
C  1.070322 -0.993801  1.546466 -1.207064
D  1.365902 -0.266971 -0.610776  2.529176
E -0.494298 -0.485794 -0.074890 -0.214137

In [10]:
#Memakai cara di atas berhasil tetapi ketika di panggil kembali
df

          W         X         Y         Z      baru
A  0.968072  0.401730  1.024553 -1.134056  1.992625
B  1.778940  0.404267  0.527373 -1.474771  2.306312
C  1.070322 -0.993801  1.546466 -1.207064  2.616788
D  1.365902 -0.266971 -0.610776  2.529176  0.755126
E -0.494298 -0.485794 -0.074890 -0.214137 -0.569188

In [17]:
#masih ada lalu bagaimana. Caranya adalah
df.drop('Z',axis=1, inplace=True) # ketika inplace True makan akan mengeksekusi secara langsung di tempat
                                        #tetapi tidak bisa menampilkan langsung datanya
df

          W         X         Y
A  0.968072  0.401730  1.024553
B  1.778940  0.404267  0.527373
C  1.070322 -0.993801  1.546466
D  1.365902 -0.266971 -0.610776
E -0.494298 -0.485794 -0.074890

In [19]:
df.drop('E',axis=0) #axis=0 adalah baris

          W         X         Y
A  0.968072  0.401730  1.024553
B  1.778940  0.404267  0.527373
C  1.070322 -0.993801  1.546466
D  1.365902 -0.266971 -0.610776

In [20]:
#Menampilkan data satu baris 
df.loc['A'] #A adalah nama index labels

W    0.968072
X    0.401730
Y    1.024553
Name: A, dtype: float64

In [21]:
df.iloc[2] #untuk mendapatkan data by index

W    1.070322
X   -0.993801
Y    1.546466
Name: C, dtype: float64

In [25]:
#mendapatkan data terperinci
df.loc['C','X'] #Mengambil data dari baris C dan kolom X

-0.9938006385165153

In [26]:
df.loc[['A','B'],['W','Y']] #Mengambil data dari baris A dan B, kolom W  dan Y

          W         Y
A  0.968072  1.024553
B  1.778940  0.527373

In [27]:
#Seleksi kondisi
df > 0 #Menseleksi data yang lebih dari 0

       W      X      Y
A   True   True   True
B   True   True   True
C   True  False   True
D   True  False  False
E  False  False  False

In [28]:
df[df>0]

          W         X         Y
A  0.968072  0.401730  1.024553
B  1.778940  0.404267  0.527373
C  1.070322       NaN  1.546466
D  1.365902       NaN       NaN
E       NaN       NaN       NaN

In [29]:
#menampilkan data berdasarkan kolom W yang lebih dari 0
df[df['W']>0]

          W         X         Y
A  0.968072  0.401730  1.024553
B  1.778940  0.404267  0.527373
C  1.070322 -0.993801  1.546466
D  1.365902 -0.266971 -0.610776

In [31]:
#menampilkan data kolom Y berdasarkan pada kolom W yang Lebih dari 0
df[df['W']>0]['Y']

A    1.024553
B    0.527373
C    1.546466
D   -0.610776
Name: Y, dtype: float64

In [9]:
#menampilkan data kolom y dan x berdasarkan pada kolom w yang lebih dari 0
df[df['W']<0] [['Y','X']]

NameError: name 'df' is not defined

In [12]:
df[(df['W']>0) & (df['X']>1)]

NameError: name 'df' is not defined